content/Discrete-Structures/Set Theory/_index.md
+++
title = "Set Theory"
author = ["David Lewis"]
draft = false
+++

## Sets {#sets}

unordered collection (group) of zero or more distinct objects

-   set theory (operations about sets)
-   S,T,U,A,B ... for sets
-   List elements in curly braces `{a, b, c}`
-   Sets are equal if and only if they contain the same elements.


### Set Builder {#set-builder}

-   \\(\\{x:P(x)\\}\\), \\(\\{x|P(x)\\}\\).
-   The set of all x such that P(x)
-   {x: x is an integer where x>0 and x<5}


### Set relations {#set-relations}

-   \\(\forall\\) for all
-   \\(\rightarrow\\) implies
-   \\(\leftrightarrow\\) if and only if
-   \\(\exists\\) exists
-   \\(\nexists\\) does not exist
-   \\(\wedge\\) and
-   \\(\vee\\) or
-   \\(x\in S\\) x in S
-   \\(x \notin S\\) x not in S


### Empty set {#empty-set}

-   \\(\varnothing = \\{\\}\\)


### Subset and superset {#subset-and-superset}

-   \\(S\subseteq T\\) subset
-   \\(S \supseteq T\\) superset
-   \\(S\subset T\\) proper set
-   \\(S \supset T\\) proper superset


### Cardinality {#cardinality}

-   \\(|S|\\) Cardinality of S or the number of elements in S


### Universal Set {#universal-set}

-   \\(U\\) is the set containing all other sets (in the problem)
-   universe of discorse


### Union {#union}

-   \\(\\{a,b,c\\} \cup \\{c,e\\} = \\{a,b,c,e\\}\\)


### Intersection {#intersection}

-   \\(\\{a,b,c\\} \cap \\{c,e\\} = \\{c\\}\\)


### Disjointedness {#disjointedness}

\\(A \cap B = \varnothing\\)


### Set difference {#set-difference}

-   \\(A - B\\)
-   \\(\\{a,b,c\\} - \\{c,e\\} = \\{a, b\\}\\)
-   Set of all elements in A but not B
-   Compliment with universal set


### Compliment {#compliment}

-   \\(\bar A = U - A\\)


### Symmetric difference {#symmetric-difference}

-   \\(A \bigoplus B = A \cup B - A \cap B\\)


### Cartesian product {#cartesian-product}

-   \\(A \times B = \\{(a,b) | a \in A \text{\: and \:} b \in B\\}\\)
-   \\(|A| \times |B| = |A \times B|\\)


### Generalized Union and Intersection {#generalized-union-and-intersection}

Union or intersection of many sets.
